"use client";

import styled from "styled-components";
import FAQAccordion from "./components/FAQAccordion";

const FAQ = () => {
  return (
    <>
      <FAQSection>
        <FAQTitle>FAQ</FAQTitle>
        <FAQAccordionWrap>
          <FAQAccordion
            eventKey={"0"}
            header={"프로젝트는 어떻게 진행이 되나요?"}
            body={` FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이
          들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다.
          간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로
          넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다.`}
          />
          <FAQAccordion
            eventKey={"1"}
            header={"프로젝트는 어떻게 진행이 되나요?"}
            body={` FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이
          들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다.
          간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로
          넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다.`}
          />
          <FAQAccordion
            eventKey={"2"}
            header={"프로젝트는 어떻게 진행이 되나요?"}
            body={` FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이
          들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다.
          간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로
          넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다.`}
          />
          <FAQAccordion
            eventKey={"3"}
            header={"프로젝트는 어떻게 진행이 되나요?"}
            body={` FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이
          들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다.
          간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로
          넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다.`}
          />
          <FAQAccordion
            eventKey={"4"}
            header={"프로젝트는 어떻게 진행이 되나요?"}
            body={` FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이
          들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다.
          간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로
          넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다.`}
          />
          <FAQAccordion
            eventKey={"5"}
            header={"프로젝트는 어떻게 진행이 되나요?"}
            body={` FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이
          들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다.
          간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로
          넣어서 운용이 됩니다. FAQ에 대한 내용이 들어가는 위치입니다. 간단하게 텍스트 위주로 넣어서 운용이 됩니다.`}
          />
        </FAQAccordionWrap>
      </FAQSection>
    </>
  );
};

export default FAQ;

const FAQSection = styled.section`
  background-color: #1a1f27;
  margin-top: 160px;
  padding: 0 10px 140px 10px;

  @media (min-width: 1200px) {
    padding: 0 120px 160px 120px;
  }
`;

const FAQTitle = styled.p`
  padding-top: 60px;
  font-size: 42px;
  font-weight: 600;
  line-height: 1.14;
  color: #fff;
`;

const FAQAccordionWrap = styled.div`
  margin-top: 65px;

  @media (min-width: 1200px) {
    margin-top: 61px;
  }
`;
